{
  "args": {
    "cursor": {
      "desc": "Set cursor to next_cursor returned by the previous call to list items in the next page",
      "example": "5c3e53d5",
      "name": "cursor",
      "required": false,
      "type": "string"
    },
    "enterprise_id": {
      "desc": "",
      "example": "E0AS553RN",
      "name": "enterprise_id",
      "required": false,
      "type": "string"
    },
    "limit": {
      "desc": "The maximum number of items to return. Must be between 1 - 1000 both inclusive.",
      "example": "100100",
      "name": "limit",
      "required": false,
      "type": "integer"
    },
    "team_id": {
      "desc": "",
      "example": "T0HFE6EBT",
      "name": "team_id",
      "required": false,
      "type": "string"
    },
    "token": {
      "desc": "Authentication token bearing required scopes. Tokens should be passed as an HTTP Authorization header or alternatively, as a POST parameter.",
      "example": "xxxx-xxxxxxxxx-xxxx",
      "name": "token",
      "required": true,
      "type": "token"
    }
  },
  "content_types": [
    "application/x-www-form-urlencoded"
  ],
  "desc": "List approved apps for an org or workspace.",
  "errors": {
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "app_management_app_not_installed_on_org": "The app management app must be installed on the org.",
    "not_an_admin": "This method is only accessible by org/workspace owners and admins",
    "team_not_found": "Returned when team id is not found.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "not_authed": "No authentication token provided.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "is_bot": "This method cannot be called by a bot user.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/jsonapplication/x-www-form-urlencodedmultipart/form-datatext/plain.",
    "not_allowed": "The user is not allowed to access this API method",
    "too_many_teams_provided": "Please provide only team_id OR enterprise_id.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_form_data": "The method was called via a POST request with Content-Typeapplication/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "accesslimited": "Access to this method is limited on the current network",
    "invalid_cursor": "Value passed for cursor was not valid or is no longer valid.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "feature_not_enabled": "Returned when the Admin APIs feature is not enabled for this team",
    "invalid_actor": "The provided actor_id is not a valid user or application",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed are invalid, which is more likely when using complex arguments like blocks or attachments.",
    "two_factor_setup_required": "Two factor setup is required.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "service_unavailable": "The service is temporarily unavailable",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "token_expired": "Authentication token has expired",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8iso-8859-1.",
    "method_deprecated": "The method has been deprecated."
  },
  "is_deprecated": false,
  "link": "/methods/admin.apps.approved.list",
  "name": "admin.apps.approved.list",
  "response": {
    "approved_apps": [
      {
        "app": {
          "additional_info": "",
          "app_directory_url": "https://myteam.enterprise.slack.com/apps/A0W7UKG8E-my-test-app",
          "app_homepage_url": "https://www.slack.com",
          "description": "test app",
          "developer_type": "third_party",
          "help_url": "https://www.slack.com",
          "icons": {
            "image_1024": "https://3026743124446w96_2bd4ea1ad1f89a23c242_1024.png",
            "image_128": "https://30267341249446w6_2bd4ea1ad1f89a23c242_128.png",
            "image_192": "https://30267431249446w6_2bd4ea1ad1f89a23c242_192.png",
            "image_32": "https://302674312496446w_2bd4ea1ad1f89a23c242_32.png",
            "image_36": "https://302674312496446w_2bd4ea1ad1f89a23c242_36.png",
            "image_48": "https://302674312496446w_2bd4ea1ad1f89a23c242_48.png",
            "image_512": "https://30267431249446w6_2bd4ea1ad1f89a23c242_512.png",
            "image_64": "https://302674312496446w_2bd4ea1ad1f89a23c242_64.png",
            "image_72": "https://302674312496446w_2bd4ea1ad1f89a23c242_72.png",
            "image_96": "https://302674312496446w_2bd4ea1ad1f89a23c242_96.png",
            "image_original": "https://302674446w12496_2bd4ea1ad1f89a23c242_original.png"
          },
          "id": "A0W7UKG8E",
          "is_app_directory_approved": false,
          "is_internal": false,
          "name": "My Test App",
          "privacy_policy_url": "https://www.slack.com",
          "socket_mode_enabled": false
        },
        "date_updated": 1574296707,
        "last_resolved_by": {
          "actor_id": "W0G82F4FD",
          "actor_type": "user"
        },
        "scopes": [
          {
            "description": "Add the ability for people to direct message or mention @my_test_app",
            "is_sensitive": true,
            "name": "bot",
            "token_type": "bot"
          }
        ]
      }
    ],
    "ok": true,
    "response_metadata": {
      "next_cursor": ""
    }
  },
  "warnings": {
    "missing_charset": "The method was called via a POST request, and recommended practice for the specified Content-Type is to include a charset parameter. However, no charset was present. Specifically, non-form-data content types (e.g. text/plain) are the ones for which charset is recommended.",
    "superfluous_charset": "The method was called via a POST request, and the specified Content-Type is not defined to understand the charset parameter. However, charset was in fact present. Specifically, form-data content types (e.g. multipart/form-data) are the ones for which charset is superfluous."
  }
}