{
  "args": {
    "channel_id": {
      "desc": "The encoded channel_id to add or remove to workspaces.",
      "example": "",
      "name": "channel_id",
      "required": true,
      "type": "string"
    },
    "org_channel": {
      "desc": "True if channel has to be converted to an org channel",
      "example": "falsetrue",
      "name": "org_channel",
      "required": false,
      "type": "boolean"
    },
    "target_team_ids": {
      "desc": "A comma-separated list of workspaces to which the channel should be shared. Not required if the channel is being shared org-wide.",
      "example": "T1234,T5678,T9012,T3456",
      "name": "target_team_ids",
      "required": false,
      "type": "array"
    },
    "team_id": {
      "desc": "The workspace to which the channel belongs. Omit this argument if the channel is a cross-workspace shared channel.",
      "example": "",
      "name": "team_id",
      "required": false,
      "type": "string"
    },
    "token": {
      "desc": "Authentication token bearing required scopes. Tokens should be passed as an HTTP Authorization header or alternatively, as a POST parameter.",
      "example": "xxxx-xxxxxxxxx-xxxx",
      "name": "token",
      "required": true,
      "type": "token"
    }
  },
  "content_types": [
    "application/x-www-form-urlencoded",
    "application/json"
  ],
  "desc": "Set the workspaces in an Enterprise grid org that connect to a public or private channel.",
  "errors": {
    "not_allowed_for_grid_workspace": "Slack Connect is not allowed for this grid workspace",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "invalid_channel_id": "channel_id was invalid.",
    "externally_shared_or_disconnected_channel": "The channel is or was externally shared.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "name_taken": "The channel's name was already used in one of the workspce.",
    "could_not_set_teams_for_channel": "The requested channel_id has not been shared with the target workspace.",
    "channel_type_not_supported": "The requested channel_id is not a supported type of channel.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "not_authed": "No authentication token provided.",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "is_bot": "This method cannot be called by a bot user.",
    "invalid_target_team": "Target workspace is invalid.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/jsonapplication/x-www-form-urlencodedmultipart/form-datatext/plain.",
    "restricted_action": "The caller of this API is not allowed to perform this operation.",
    "too_many_target_teams": "Too many target_team_ids were provided.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_form_data": "The method was called via a POST request with Content-Typeapplication/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "unsupported_arguments": "The provided method arguments are not supported.",
    "accesslimited": "Access to this method is limited on the current network",
    "channel_cannot_be_unshared": "Channel cannot be unshared from this workspace.",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "default_org_wide_channel": "Default org wide channel cannot be unshared from a workspace.",
    "not_enabled": "The API endpoint is not enabled for your team.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "channel_not_found": "The channel wasn't found or isn't shared to this workspace.",
    "cannot_move_local_channel": "This API cannot be used to move a local channel from one workspace to another.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed are invalid, which is more likely when using complex arguments like blocks or attachments.",
    "two_factor_setup_required": "Two factor setup is required.",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "service_unavailable": "The service is temporarily unavailable",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "token_expired": "Authentication token has expired",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8iso-8859-1.",
    "cannot_add_legacy_disconnected_channel_to_workspaces": "Cannot add legacy disconnected channel to workspaces",
    "method_deprecated": "The method has been deprecated."
  },
  "is_deprecated": false,
  "link": "/methods/admin.conversations.setTeams",
  "name": "admin.conversations.setTeams",
  "response": {
    "ok": true
  },
  "warnings": {
    "missing_charset": "The method was called via a POST request, and recommended practice for the specified Content-Type is to include a charset parameter. However, no charset was present. Specifically, non-form-data content types (e.g. text/plain) are the ones for which charset is recommended.",
    "superfluous_charset": "The method was called via a POST request, and the specified Content-Type is not defined to understand the charset parameter. However, charset was in fact present. Specifically, form-data content types (e.g. multipart/form-data) are the ones for which charset is superfluous."
  }
}