{
  "args": {
    "as_user": {
      "desc": "Pass true to update the message as the authed user. Bot users in this context are considered authed users.",
      "example": "true",
      "name": "as_user",
      "required": false,
      "type": "boolean"
    },
    "attachments": {
      "desc": "A JSON-based array of structured attachments, presented as a URL-encoded string. This field is required when not presenting text. If you don't include this field, the message's previous attachments will be retained. To remove previous attachments, include an empty array for this field.",
      "example": "[{\"pretext\": \"pre-hello\", \"text\": \"text-world\"}]",
      "name": "attachments",
      "required": false,
      "type": "string"
    },
    "blocks": {
      "desc": "A JSON-based array of structured blocks, presented as a URL-encoded string. If you don't include this field, the message's previous blocks will be retained. To remove previous blocks, include an empty array for this field.",
      "example": "[{\"type\": \"section\", \"text\": {\"type\": \"plain_text\", \"text\": \"Hello world\"}}]",
      "name": "blocks",
      "required": false,
      "type": "blocks[] as string"
    },
    "channel": {
      "desc": "Channel containing the message to be updated.",
      "example": "C1234567890",
      "name": "channel",
      "required": true,
      "type": "string"
    },
    "file_ids": {
      "desc": "Array of new file ids that will be sent with this message.",
      "example": "F013GKY52QK,F013GL22D0T or [\"F013GKY52QK\",\"F013GL22D0T\"]",
      "name": "file_ids",
      "required": false,
      "type": "array"
    },
    "link_names": {
      "desc": "Find and link channel names and usernames. Defaults to none. If you do not specify a value for this field, the original value set for the message will be overwritten with the default, none.",
      "example": "true",
      "name": "link_names",
      "required": false,
      "type": "boolean"
    },
    "metadata": {
      "desc": "JSON object with event_type and event_payload fields, presented as a URL-encoded string. If you don't include this field, the message's previous metadata will be retained. To remove previous metadata, include an empty object for this field. Metadata you post to Slack is accessible to any app or user who is a member of that workspace.",
      "example": "{\"event_type\": \"task_created\", \"event_payload\": { \"id\": \"11223\", \"title\": \"Redesign Homepage\"}}",
      "name": "metadata",
      "required": false,
      "type": "string"
    },
    "parse": {
      "desc": "Change how messages are treated. Defaults to client, unlike chat.postMessage. Accepts either none or full. If you do not specify a value for this field, the original value set for the message will be overwritten with the default, client.",
      "example": "none",
      "name": "parse",
      "required": false,
      "type": "string"
    },
    "reply_broadcast": {
      "desc": "Broadcast an existing thread reply to make it visible to everyone in the channel or conversation.",
      "example": "falsetrue",
      "name": "reply_broadcast",
      "required": false,
      "type": "boolean"
    },
    "text": {
      "desc": "New text for the message, using the default formatting rules. It's not required when presenting blocks or attachments.",
      "example": "Hello world",
      "name": "text",
      "required": false,
      "type": "string"
    },
    "token": {
      "desc": "Authentication token bearing required scopes. Tokens should be passed as an HTTP Authorization header or alternatively, as a POST parameter.",
      "example": "xxxx-xxxxxxxxx-xxxx",
      "name": "token",
      "required": true,
      "type": "token"
    },
    "ts": {
      "desc": "Timestamp of the message to be updated.",
      "example": "\"1405894322.002768\"",
      "name": "ts",
      "required": true,
      "type": "string"
    }
  },
  "content_types": [
    "application/x-www-form-urlencoded",
    "application/json"
  ],
  "desc": "Updates a message.",
  "errors": {
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "no_dual_broadcast_content_update": "Can't broadcast an old reply and update the content at the same time.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "msg_too_long": "Message text is too long",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "no_text": "No message text provided",
    "as_user_not_supported": "The as_user parameter does not function with workspace apps.",
    "invalid_metadata_format": "Invalid metadata format provided",
    "team_access_not_granted": "The token used is not granted the specific workspace access required to complete this request.",
    "team_not_found": "Team associated with the message and channel could not be found.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "update_failed": "Internal update failure.",
    "not_authed": "No authentication token provided.",
    "metadata_too_large": "Metadata exceeds size limit",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "cant_update_message": "Authenticated user does not have permission to update this message.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/jsonapplication/x-www-form-urlencodedmultipart/form-datatext/plain.",
    "external_channel_migrating": "The channel is in the process of migrating and so the message cannot be updated at this time.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "cant_broadcast_message": "Unable to broadcast this message.",
    "invalid_attachments": "The attachments were invalid.",
    "invalid_form_data": "The method was called via a POST request with Content-Typeapplication/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_metadata_schema": "Invalid metadata schema provided",
    "too_many_attachments": "Too many attachments were provided with this message. A maximum of 100 attachments are allowed on a message.",
    "accesslimited": "Access to this method is limited on the current network",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "edit_window_closed": "The message cannot be edited due to the team message edit settings",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "is_inactive": "The message cannot be edited within a frozen, archived or deleted channel.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "invalid_blocks": "The blocks were invalid for the requesting user.",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "channel_not_found": "Value passed for channel was invalid.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed are invalid, which is more likely when using complex arguments like blocks or attachments.",
    "two_factor_setup_required": "Two factor setup is required.",
    "metadata_must_be_sent_from_app": "Message metadata can only be posted or updated using an app token",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "message_not_found": "No message exists with the requested timestamp.",
    "service_unavailable": "The service is temporarily unavailable",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "slack_connect_file_link_sharing_blocked": "Admin has disabled Slack File sharing in all Slack Connect communications",
    "token_expired": "Authentication token has expired",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8iso-8859-1.",
    "method_deprecated": "The method has been deprecated."
  },
  "is_deprecated": false,
  "link": "/methods/chat.update",
  "name": "chat.update",
  "response": {
    "channel": "C024BE91L",
    "message": {
      "text": "Updated text you carefully authored",
      "user": "U34567890"
    },
    "ok": true,
    "text": "Updated text you carefully authored",
    "ts": "1401383885.000061"
  },
  "warnings": {
    "message_truncated": "The text field of a message should have no more than 40,000 characters. We truncate really long messages.",
    "missing_charset": "The method was called via a POST request, and recommended practice for the specified Content-Type is to include a charset parameter. However, no charset was present. Specifically, non-form-data content types (e.g. text/plain) are the ones for which charset is recommended.",
    "superfluous_charset": "The method was called via a POST request, and the specified Content-Type is not defined to understand the charset parameter. However, charset was in fact present. Specifically, form-data content types (e.g. multipart/form-data) are the ones for which charset is superfluous."
  }
}