{
  "args": {
    "as_user": {
      "desc": "Set to true to post the message as the authed user, instead of as a bot. Defaults to false. Cannot be used by new Slack apps. See chat.postMessage.",
      "example": "true",
      "name": "as_user",
      "required": false,
      "type": "boolean"
    },
    "attachments": {
      "desc": "A JSON-based array of structured attachments, presented as a URL-encoded string.",
      "example": "[{\"pretext\": \"pre-hello\", \"text\": \"text-world\"}]",
      "name": "attachments",
      "required": false,
      "type": "string"
    },
    "blocks": {
      "desc": "A JSON-based array of structured blocks, presented as a URL-encoded string.",
      "example": "[{\"type\": \"section\", \"text\": {\"type\": \"plain_text\", \"text\": \"Hello world\"}}]",
      "name": "blocks",
      "required": false,
      "type": "blocks[] as string"
    },
    "channel": {
      "desc": "Channel, private group, or DM channel to send message to. Can be an encoded ID, or a name. See below for more details.",
      "example": "C1234567890",
      "name": "channel",
      "required": true,
      "type": "string"
    },
    "link_names": {
      "desc": "Find and link user groups. No longer supports linking individual users; use syntax shown in Mentioning Users instead.",
      "example": "true",
      "name": "link_names",
      "required": false,
      "type": "boolean"
    },
    "metadata": {
      "desc": "JSON object with event_type and event_payload fields, presented as a URL-encoded string. Metadata you post to Slack is accessible to any app or user who is a member of that workspace.",
      "example": "{\"event_type\": \"task_created\", \"event_payload\": { \"id\": \"11223\", \"title\": \"Redesign Homepage\"}}",
      "name": "metadata",
      "required": false,
      "type": "string"
    },
    "parse": {
      "desc": "Change how messages are treated. See chat.postMessage.",
      "example": "full",
      "name": "parse",
      "required": false,
      "type": "string"
    },
    "post_at": {
      "desc": "Unix EPOCH timestamp of time in future to send the message.",
      "example": "299876400",
      "name": "post_at",
      "required": true,
      "type": "integer"
    },
    "reply_broadcast": {
      "desc": "Used in conjunction with thread_ts and indicates whether reply should be made visible to everyone in the channel or conversation. Defaults to false.",
      "example": "true",
      "name": "reply_broadcast",
      "required": false,
      "type": "boolean"
    },
    "text": {
      "desc": "How this field works and whether it is required depends on other fields you use in your API call. See below for more detail.",
      "example": "Hello world",
      "name": "text",
      "required": true,
      "type": "string"
    },
    "thread_ts": {
      "desc": "Provide another message's ts value to make this message a reply. Avoid using a reply's ts value; use its parent instead.",
      "example": "",
      "name": "thread_ts",
      "required": false,
      "type": "string"
    },
    "token": {
      "desc": "Authentication token bearing required scopes. Tokens should be passed as an HTTP Authorization header or alternatively, as a POST parameter.",
      "example": "xxxx-xxxxxxxxx-xxxx",
      "name": "token",
      "required": true,
      "type": "token"
    },
    "unfurl_links": {
      "desc": "Pass true to enable unfurling of primarily text-based content.",
      "example": "true",
      "name": "unfurl_links",
      "required": false,
      "type": "boolean"
    },
    "unfurl_media": {
      "desc": "Pass false to disable unfurling of media content.",
      "example": "false",
      "name": "unfurl_media",
      "required": false,
      "type": "boolean"
    }
  },
  "content_types": [
    "application/x-www-form-urlencoded",
    "application/json"
  ],
  "desc": "Schedules a message to be sent to a channel.",
  "errors": {
    "invalid_blocks_format": "The blocks is not a valid JSON object or doesn't match the Block Kit syntax.",
    "missing_scope": "The token used is not granted the specific scope permissions required to complete this request.",
    "ekm_access_denied": "Administrators have suspended the ability to post a message.",
    "internal_error": "The server could not complete your operation(s) without encountering an error, likely due to a transient issue on our end. It's possible some aspect of the operation succeeded before the error was raised.",
    "msg_too_long": "Message text is too long",
    "account_inactive": "Authentication token is for a deleted user or workspace when using a bot token.",
    "no_text": "No message text provided",
    "invalid_time": "value passed for post_time was invalid.",
    "invalid_metadata_format": "Invalid metadata format provided",
    "team_access_not_granted": "The token used is not granted the specific workspace access required to complete this request.",
    "access_denied": "Access to a resource specified in the request is denied.",
    "fatal_error": "The server could not complete your operation(s) without encountering a catastrophic error. It's possible some aspect of the operation succeeded before the error was raised.",
    "not_authed": "No authentication token provided.",
    "restricted_action_non_threadable_channel": "Cannot post thread replies into a non_threadable channel.",
    "restricted_too_many": "Too many messages were scheduled in the channel for a given period. See usage info for additional details",
    "metadata_too_large": "Metadata exceeds size limit",
    "team_added_to_org": "The workspace associated with your request is currently undergoing migration to an Enterprise Organization. Web API and other platform operations will be intermittently unavailable until the transition is complete.",
    "is_archived": "Channel has been archived.",
    "time_in_past": "value passed for post_time was in the past.",
    "invalid_arg_name": "The method was passed an argument whose name falls outside the bounds of accepted or expected values. This includes very long names and names with non-alphanumeric characters other than _. If you get this error, it is typically an indication that you have made a very malformed API call.",
    "invalid_post_type": "The method was called via a POST request, but the specified Content-Type was invalid. Valid types are: application/jsonapplication/x-www-form-urlencodedmultipart/form-datatext/plain.",
    "restricted_action": "A workspace preference prevents the authenticated user from posting.",
    "token_revoked": "Authentication token is for a deleted user or workspace or the app has been removed when using a user token.",
    "deprecated_endpoint": "The endpoint has been deprecated.",
    "invalid_array_arg": "The method was passed an array as an argument. Please only input valid strings.",
    "invalid_form_data": "The method was called via a POST request with Content-Typeapplication/x-www-form-urlencoded or multipart/form-data, but the form data was either missing or syntactically invalid.",
    "invalid_metadata_schema": "Invalid metadata schema provided",
    "too_many_attachments": "Too many attachments were provided with this message. A maximum of 100 attachments are allowed on a message.",
    "rate_limited": "Application has posted too many messages, read the Rate Limit documentation for more information",
    "accesslimited": "Access to this method is limited on the current network",
    "enterprise_is_restricted": "The method cannot be called from an Enterprise.",
    "restricted_action_read_only_channel": "Cannot post any message into a read-only channel.",
    "time_too_far": "value passed for post_time was too far into the future.",
    "org_login_required": "The workspace is undergoing an enterprise migration and will not be available until migration is complete.",
    "not_allowed_token_type": "The token type used in this request is not allowed.",
    "invalid_blocks": "Blocks submitted with this message are not valid",
    "invalid_auth": "Some aspect of authentication cannot be validated. Either the provided token is invalid or the request originates from an IP address disallowed from making the request.",
    "channel_not_found": "Value passed for channel was invalid.",
    "invalid_arguments": "The method was either called with invalid arguments or some detail about the arguments passed are invalid, which is more likely when using complex arguments like blocks or attachments.",
    "two_factor_setup_required": "Two factor setup is required.",
    "metadata_must_be_sent_from_app": "Message metadata can only be posted or updated using an app token",
    "no_permission": "The workspace token used in this request does not have the permissions necessary to complete the request. Make sure your app is a member of the conversation it's attempting to post a message to.",
    "ratelimited": "The request has been ratelimited. Refer to the Retry-After header for when to retry the request.",
    "service_unavailable": "The service is temporarily unavailable",
    "missing_post_type": "The method was called via a POST request and included a data payload, but the request did not include a Content-Type header.",
    "request_timeout": "The method was called via a POST request, but the POST data was either missing or truncated.",
    "slack_connect_file_link_sharing_blocked": "Admin has disabled Slack File sharing in all Slack Connect communications",
    "restricted_action_thread_only_channel": "Cannot post top-level messages into a thread-only channel.",
    "token_expired": "Authentication token has expired",
    "invalid_charset": "The method was called via a POST request, but the charset specified in the Content-Type header was invalid. Valid charset names are: utf-8iso-8859-1.",
    "not_in_channel": "Cannot post user messages to a channel they are not in.",
    "method_deprecated": "The method has been deprecated."
  },
  "is_deprecated": false,
  "link": "/methods/chat.scheduleMessage",
  "name": "chat.scheduleMessage",
  "response": {
    "channel": "C123456",
    "message": {
      "attachments": [
        {
          "fallback": "This is an attachment's fallback",
          "id": 1,
          "text": "This is an attachment"
        }
      ],
      "bot_id": "B123456",
      "subtype": "bot_message",
      "text": "Here's a message for you in the future",
      "type": "delayed_message",
      "username": "ecto1"
    },
    "ok": true,
    "post_at": "1562180400",
    "scheduled_message_id": "Q1298393284"
  },
  "warnings": {
    "message_truncated": "The text field of a message should have no more than 40,000 characters. We truncate really long messages.",
    "missing_charset": "The method was called via a POST request, and recommended practice for the specified Content-Type is to include a charset parameter. However, no charset was present. Specifically, non-form-data content types (e.g. text/plain) are the ones for which charset is recommended.",
    "superfluous_charset": "The method was called via a POST request, and the specified Content-Type is not defined to understand the charset parameter. However, charset was in fact present. Specifically, form-data content types (e.g. multipart/form-data) are the ones for which charset is superfluous."
  }
}